Autodesk.Revit.DB.Events.UndoOperation
The operation associated with DocumentChanged event

Autodesk.Revit.DB.Events.UndoOperation.TransactionRedone
A transaction was redone

Autodesk.Revit.DB.Events.UndoOperation.TransactionUndone
A transaction was undone

Autodesk.Revit.DB.Events.UndoOperation.TransactionGroupRolledBack
A transaction group was rolled back

Autodesk.Revit.DB.Events.UndoOperation.TransactionRolledBack
A transaction was rolled back

Autodesk.Revit.DB.Events.UndoOperation.TransactionCommitted
A transaction was committed